<?php

use Illuminate\Database\Seeder;

class SchoolTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $allSchools = array("พรหมพินิตชัยบุรี",
        "ประภัสสรรังสิต",
        "พัทลุง",
        "พัทลุงพิทยาคม",
        "วชิรธรรมสถิต",
        "สตรีพัทลุง",
        "อุบลรัตนราชกัญญาราชวิทยาลัยพัทลุง",
        "กงหราพิชากร",
        "ชะรัดชนูปถัมภ์",
        "เขาชัยสน",
        "หานโพธิ์พิทยาคม",
        "ควนขนุน",
        "ดอนศาลานำวิทยา",
        "นาขยาดวิทยาคาร",
        "ปัญญาวุธ",
        "พนางตุง",
        "อุดมวิทยายน",
        "ควนพระสาครินทร์",
        "ปากพะยูนพิทยาคาร",
        "มัธยมเกาะหมาก",
        "หารเทารังสีประชาสรรค์",
        "ตะแพนพิทยา",
        "ศรีบรรพตพิทยาคม",
        "ตะโหมด",
        "ประชาบำรุง",
        "นิคมควนขนุนวิทยา",
        "ป่าพะยอมพิทยาคม",
        "บางแก้วพิทยาคม",
        "ป่าบอนพิทยาคม",
        "พณิชยการพัทลุง",
        "อนุบาลเสริมปัญญา", 
        "อนุบาลเมตตาธรรม",
        "เรวดีพัทลุง",
        "วีรนาทศึกษามูลนิธิ", 
        "อนุบาลเรวดีควนขนุน",
        "มัธยมพัทลุงวิทยา",
        "พัทลุงคริสเตียน",
        "อารียาศึกษา",
        "อนุบาลธนะวิทย์",
        "เทศบาลบ้านคูหาสวรรค์", 
        "เทศบาลวัดภูผาภิมุข",
        "เทศบาลวัดนิโครธาราม", 
        "เทศบาลจุ่งฮั่ว",
        "เทศบาลวัดนางลาด",
        "อื่น ๆ");

        foreach($allSchools as &$n) {
            $school = new App\School;
            $school->name = $n;
            $school->save();
        }

    }
}
